sozibalmamun/STM32F446xx_Driver_API/Src/SPI_Tx_testing.c
/*
 * SPI_Tx_testing.c
 *
 *  Created on: 5 Nov 2022
 *      Author: sozib
 */
#include "stm32f446xx.h"
#include "string.h"

/*
 * SPI2
 * ALT Function Mode : 5
 * MOSI-  PB15
 * MISO-  PB14
 * CLK -  PB13
 * NSS -  PB12
 */

void SPI2_GPIOInits(void){
	GPIO_Handle_t SPIPins;
	SPIPins.pGPIOx= GPIOB;
	SPIPins.pGPIO_pin_Config.GPIO_PIN_MODE=GPIO_MODE_AL_FUNC;
	SPIPins.pGPIO_pin_Config.GPIO_PIN_ALF=5;
	SPIPins.pGPIO_pin_Config.GPIO_PIN_OPT_TYPE=GPIO_OUT_TYPE_PP;
	SPIPins.pGPIO_pin_Config.GPIO_PIN_PUPD=GPIO_PIN_NO_PUPD;
	SPIPins.pGPIO_pin_Config.GPIO_PIN_SPEED=GPIO_SPEED_FREQ_VERY_HIGH;

	// SCLK
	SPIPins.pGPIO_pin_Config.GPIO_PIN_NO=GPIO_PIN_13;
	GPIO_Int(&SPIPins);

	// MOSI
	SPIPins.pGPIO_pin_Config.GPIO_PIN_NO=GPIO_PIN_15;
	GPIO_Int(&SPIPins);

	// MISO
	SPIPins.pGPIO_pin_Config.GPIO_PIN_NO=GPIO_PIN_14;
	GPIO_Int(&SPIPins);

	// NSS
	SPIPins.pGPIO_pin_Config.GPIO_PIN_NO=GPIO_PIN_12;
	GPIO_Int(&SPIPins);

}
void SPI2_Inits(void){
	SPI_Handle_t SPI2_Handle;
	SPI2_Handle.pSPIx=SPI2;
	SPI2_Handle.Spi_Config.SPI_Bus_Config=SPI_BUS_CONFIG_FD;
	SPI2_Handle.Spi_Config.SPI_Device_Mode=SPI_DEVICE_MODE_MASTER;

	SPI2_Handle.Spi_Config.SPI_SclkSpeed=SPI_CLK_SPE_DIV_2;// Generate 8MH Clock
	SPI2_Handle.Spi_Config.SPI_DFF=SPI_DFF_8BIT;
	SPI2_Handle.Spi_Config.SPI_CPOL=SPI_CPOL_HIGH;
	SPI2_Handle.Spi_Config.SPI_CPHA=SPI_CPHA_LOW;
	SPI2_Handle.Spi_Config.SPI_SSM=SPI_SSM_EN; // Software slave management for NSS pin

	SPI_Int(&SPI2_Handle);

}
int main(void){

	char user_data[]="Hello world";
	// This function is used to initialize the GPIO pins to behave as SPI2 pins
	SPI2_GPIOInits();
	SPI2_Inits();
	/*
		 * this makes NSS signal internally High and avoid MODF error
		 * this is required when we use SSM(software slave management)
		 */
	SPI_SSI_CONFIG(SPI2, ENABLE );
	/*
	 *  Enable the SPI2 Peripheral after all the setup done
	 *  because if it done before, SPI is busy in Data communication
	 */

	SPI_Peripheral_Control(SPI2, ENABLE);
	SPI_Send_Data(SPI2, (uint8_t*)user_data, strlen(user_data));

	/*
	 * first let confirm the BUSY flag set or not
	 * if it is 1 then SPI is busy to communication
	 * if it is 0 then SPI is free
	 */
	while(Spi_Get_flagStatus( SPI2,SPI_BUSY_FLAG))
	/*
	 *  disable the SPI2 Peripheral( SPE OR SPI disable) after sending done
	 */
	SPI_Peripheral_Control(SPI2, DISABLE);

	while(1);
	return 0;
}
